Tekla Open API Reference for Tekla Structures 2025
HierarchicObject Constructor
Overload List
Name | Description
HierarchicObject()
 Creates a new hierarchical object instance.
HierarchicObject(Identifier)
 Instantiates a hierarchical object with a known identifier. The instantiation has to be done before the hierarchical definition instance can be selected.
Top
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace